---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerUiTargetView
source: html/d0311548-e10a-9232-ebe1-03da67664816.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ReferenceViewerUiTargetView Property

"Target view": This is used by the UI to allow selection of target view.
 It allows the UI to set a filter that is incompatible
 with the current target view (REFERENCE_VIEWER_TARGET_VIEW).

## Syntax (C#)
```csharp
public static ForgeTypeId ReferenceViewerUiTargetView { get; }
```